app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = 2 LIMIT 1
INSERT INTO "comments" ("commenter", "body", "post_id", "created_at", "updated_at") VALUES ('Nash', 'Hello, i guess your blog is good', 2, '2011-02-15 17:07:25.349598', '2011-02-15 17:07:25.349598')
---
  def create
    @post = Post.find(params[:post_id])
    #@comment = @post.comments.create(params[:comment])
    #redirect_to post_path(@post)

    @comment = @post.comments.new(params[:comment])
    if @comment.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = 1 AND ("posts".user_id = 2) ORDER BY created_at DESC, title ASC LIMIT 1
SELECT "comments".* FROM "comments" WHERE "comments"."id" = 1 AND ("comments".post_id = 2) LIMIT 1
DELETE FROM "comments" WHERE "comments"."id" = 1
---
  def destroy
    #@post = Post.find(params[:post_id])
    @post = current_user.posts.find(params[:post_id])
    @comment = @post.comments.find(params[:id])
    @comment.destroy

SELECT "posts".* FROM "posts" WHERE "posts"."id" = 1 LIMIT 1
---
  def load_post
    @post = Post.find(params[:post_id])