app/controllers/posts_controller.rb

  def edit
    #@post = Post.find(params[:id])
    @post = current_user.posts.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = 3 AND ("posts".user_id = 2) ORDER BY created_at DESC, title ASC LIMIT 1

  def create
    #@post = Post.new(params[:post])
    @post = current_user.posts.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("name", "title", "content", "created_at", "updated_at", "user_id") VALUES ('Nash', '谁的故乡不在观音山上？', '小时候放鞭炮，我总是躲在大人后面，胆战心惊地看他们点燃，等到烟花放完，我还在胆战心惊：因为有一次鞭炮差一响没放完，我对妈妈说，妈妈，还差一响呢。妈妈上去看了，最后一响终于响了，妈妈的眉毛也炸没了。虽然后来妈妈的眉毛又长出来了，但这是我童年时自己默默内疚的一个阴影。

  def update
    #@post = Post.find(params[:id])
    @post = current_user.posts.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = 7 AND ("posts".user_id = 2) ORDER BY created_at DESC, title ASC LIMIT 1
UPDATE "posts" SET "title" = 'HP To Put WebOS On PCs In 2012', "content" = '"Hewlett-Packard''s chief executive officer Leo Apotheker announced that WebOS will be on every PC that HP ships in 2012. A move to attract more developers and push the operating system from mobile devices onto desktops. Apotheker made the announcement during a presentation to HP''s staff in India, according to a report by Bloomberg. It''s not likely that WebOS will supplant existing operating systems on PCs, but rather would run on top of Windows to be able to launch WebOS apps. HP had previously announced its plans to push WebOS on to PC''s last month, but, at the time, the company didn''t reveal the scope of its commitment to the operating system. We now know that HP means each and every PC it sells starting in 2012 will have WebOS installed."', "updated_at" = '2011-03-09 21:43:17.084145' WHERE "posts"."id" = 7

  def destroy
    #@post = Post.find(params[:id])
    @post = current_user.posts.find(params[:id])

    @post.destroy
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = 1 AND ("posts".user_id = 2) ORDER BY created_at DESC, title ASC LIMIT 1
DELETE FROM "posts" WHERE "posts"."id" = 1

  def notify_friend
    @post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = 1 LIMIT 1