app/controllers/users_controller.rb

INSERT INTO "users" ("email", "hashed_password", "created_at", "updated_at") VALUES ('nash@example.com', '7c4a8d09ca3762af61e59520943dc26494f8941b', '2011-02-21 03:06:00.588745', '2011-02-21 03:06:00.588745')
---
  def create
    @user = User.new(params[:user])
    if @user.save